Autodesk.Revit.DB.ViewFamilyType.IsValidDefaultTemplate(Autodesk.Revit.DB.ElementId)
Verifies that the input can be used as a default template for this view type.
Remarks:
The id must represent a template view that is compatible with this view type, or InvalidElementId.
templateId:
Id to be validated as default template.
Returns:
True if %templateId% is valid as default template, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewFamilyType.ViewFamily
The ViewFamily for this view type.
Since:
2013

Autodesk.Revit.DB.ViewFamilyType.DefaultTemplateId
The default template id assigned to this view type.
Remarks:
This value will be the view template for all newly created instances of this view type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: val is not valid as a default template id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewFamilyType.PlanViewDirection
The PlanViewDirection of this view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: PlanViewDirection cannot be set to Undefined
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: View must be a Structural Plan
Since:
2013

Autodesk.Revit.DB.ViewFamilyType
Represents a type of a Revit view.
Remarks:
ViewFamilyTypes represent possible types for a Revit view and contain view type related properties and options such as the default template associated to views
created from this type.  They are commonly input to new View creation methods in the Revit API.
Since:
2013